// Тестовый бин с аннотацией &Наблюдаемый на уровне отдельных методов.

&Желудь
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&Наблюдаемый
Функция НаблюдаемыйМетод() Экспорт
	Возврат "наблюдаемый";
КонецФункции

&Наблюдаемый(ВидСпана = "server")
Функция МетодСервер() Экспорт
	Возврат "сервер";
КонецФункции

&Наблюдаемый
Функция МетодСАтрибутом(&АтрибутСпана("order.id") ИдЗаказа, &АтрибутСпана UserИд) Экспорт
	Возврат ИдЗаказа + "/" + UserИд;
КонецФункции

&Наблюдаемый
Процедура МетодСОшибкой() Экспорт
	ВызватьИсключение "тестовая-ошибка";
КонецПроцедуры
