// BSLLS:MissingVariablesDescription-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:MissingParameterDescription-off
// BSLLS:MissingReturnedValueDescription-off
#Использовать autumn
#Использовать asserts
#Использовать opentelemetry
#Использовать ".."
#Использовать "."

Функция СоздатьПоделку()

	Поделка = Новый Поделка();
	Поделка.ПросканироватьКаталог("tests/Классы");
	Поделка.ЗапуститьПриложение();
	Возврат Поделка;

КонецФункции

&Тест
Процедура НапильникНаблюдаемый_МетодВыполняетсяБезОшибок() Экспорт

	// Дано
	ОтелКонтекст.Очистить();
	Поделка = СоздатьПоделку();

	// Когда
	Служба = Поделка.НайтиЖелудь("НаблюдаемаяСлужба");
	Результат = Служба.ВыполнитьОперацию("тест");

	// Тогда
	Ожидаем.Что(Результат).Равно("тест_выполнено");

	ОтелКонтекст.Очистить();

КонецПроцедуры

&Тест
Процедура НапильникНаблюдаемый_МетодВозвращаетЗначение() Экспорт

	// Дано
	ОтелКонтекст.Очистить();
	Поделка = СоздатьПоделку();

	// Когда
	Служба = Поделка.НайтиЖелудь("НаблюдаемаяСлужба");
	Результат = Служба.ПолучитьЗначение();

	// Тогда
	Ожидаем.Что(Результат).Равно("тестовое-значение");

	ОтелКонтекст.Очистить();

КонецПроцедуры
