// BSLLS:MissingVariablesDescription-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:MissingParameterDescription-off
// BSLLS:MissingReturnedValueDescription-off
#Использовать autumn
#Использовать asserts
#Использовать opentelemetry
#Использовать ".."
#Использовать "."

Перем Поделка;

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

&ПередКаждым
Процедура ПередКаждым() Экспорт
	ОтелКонтекст.Очистить();
	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();
КонецПроцедуры

&ПослеКаждого
Процедура ПослеКаждого() Экспорт
	ОтелКонтекст.Очистить();
КонецПроцедуры

&Тест
Процедура НапильникНаблюдаемый_МетодВыполняетсяБезОшибок() Экспорт

	// Когда
	Служба = Поделка.НайтиЖелудь("НаблюдаемаяСлужба");
	Результат = Служба.ВыполнитьОперацию("тест");

	// Тогда
	Ожидаем.Что(Результат).Равно("тест_выполнено");

КонецПроцедуры

&Тест
Процедура НапильникНаблюдаемый_МетодВозвращаетЗначение() Экспорт

	// Когда
	Служба = Поделка.НайтиЖелудь("НаблюдаемаяСлужба");
	Результат = Служба.ПолучитьЗначение();

	// Тогда
	Ожидаем.Что(Результат).Равно("тестовое-значение");

КонецПроцедуры
